In [1]:
import pandas as pd
import seaborn as sns

In [2]:
df = sns.load_dataset("titanic")

In [ ]:
# toplulaştırma ne demek buna bakacak olursak: 
# bir veri yapısı içerisindeki bulunan değerleri toplu bir şekilde ifade etmeye toplulaştırma işlemleri denir.
# Toplulaştırma fonksiyonları:

# - count()
# - first()
# - last()
# - mean()
# - median()
# - min()
# - max()
# - std()
# - var()
# - sum()
# - pivot table

In [3]:
# Yaş ortalamasını öğrenmek istediğimde:

df["age"].mean()

29.69911764705882

In [7]:
# peki yaş ortalamasını cinsiyete göre yapmak istersem?
# bu aşağıdaki el ile girmiş olduğum değer.

df[df["sex"] == "male"]["age"].mean()

30.72664459161148

In [8]:
# birde burada femla ve male olarak otomatik olaraak python tarafından ayırırmak istersem:

df.groupby("sex")["age"].mean()

sex
female    27.915709
male      30.726645
Name: age, dtype: float64

In [9]:
# sık kullanılan yöntem:


df.groupby("sex").agg({"age": "mean"})

              age
sex
female  27.915709
male    30.726645

In [10]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [11]:
# yukarıdaki yöntemin avantajı birden fazla durumu göstermek
# Example: hem erkekleri, hem de yaşayıp yaşamadığını gösteren bir durum olsun

df.groupby("sex").agg({"age": "mean",
                       "survived":["sum","count"]})

              age survived
             mean      sum count
sex
female  27.915709      233   314
male    30.726645      109   577

In [15]:
# eğer ben sadece cinsiyee göre bir kırılım değil de farklı gruplara göre de kırılım yapmak istersem.

# işte o zaman yapmam gerekenler:

df.groupby(["sex", "embark_town"]).agg({"age" : "mean",
                                        "survived": "mean"})

                          age  survived
sex    embark_town
female Cherbourg    28.344262  0.876712
       Queenstown   24.291667  0.750000
       Southampton  27.771505  0.689655
male   Cherbourg    32.998841  0.305263
       Queenstown   30.937500  0.073171
       Southampton  30.291440  0.174603